// data/achievements.js

const achievements = [
  {
    name: "А ты хорош!",
    requirement: "Убить 5 воинов в бою.",
    reward: "+$p(1000) и 500 XP"
  },
  {
    name: "Успокойся парень!",
    requirement: "Убить 10 воинов в бою.",
    reward: "+$p(5000) и 2 500 XP"
  },
  {
    name: "Успокойся парень!",
    requirement: "Убить 20 воинов в бою.",
    reward: "+$p(10000) и 5 000 XP"
  },
  {
    name: "RAMPAGE!",
    requirement: "Убить 50 воинов в бою.",
    reward: "+$p(20000) и 10 000 XP"
  },
  {
    name: "Стрим Снайпер",
    requirement: "Убить стримера в бою.",
    reward: "+$p(100000) и 50 000 XP"
  },
  {
    name: "Надежный",
    requirement: "5 и более раз вступить в бой на стороне стримера.",
    reward: "+$p(20000)"
  },
  {
    name: "Доверенный",
    requirement: "20 и более раз вступить в бой на стороне стримера.",
    reward: "+$p(50000)"
  },
  {
    name: "Верный",
    requirement: "50 и более раз вступить в бой на стороне стримера.",
    reward: "+$p(250000) и 50 000XP"
  },
  {
    name: "ГЕРОИЧЕСКОЕ ДОСТИЖЕНИЕ!",
    requirement: "100 и более раз вступить в бой на стороне стримера.",
    reward: "+$p(1000000) и 100 000XP"
  },
  {
    name: "Мятежный",
    requirement: "5 и более раз вступить в бой против стримера.",
    reward: "+$p(20000)"
  },
  {
    name: "Предатель",
    requirement: "20 и более раз вступить в бой против стримера.",
    reward: "+$p(50000)"
  },
  {
    name: "Отступник",
    requirement: "50 и более раз вступить в бой против стримера.",
    reward: "+$p(250000) и 50 000XP"
  },
  {
    name: "ВРАГ НАРОДА!",
    requirement: "100 и более раз вступить в бой против стримера.",
    reward: "+$p(1000000) и 100 000XP"
  },
];